Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# rag.workspace.debug.rerank.appliedMissingResponseNoteFormat
source: Note: Rerank did not return %lld submitted candidates; their hybrid retrieval order was retained.
ar: ملاحظة: لم تُرجع إعادة الترتيب %lld مرشحًا مقدمًا؛ تم الاحتفاظ بترتيب الاسترجاع المختلط لهم.
de: Hinweis: Rerank hat %lld eingereichte Kandidaten nicht zurückgegeben; deren hybride Abrufreihenfolge wurde beibehalten.
es: Nota: Rerank no devolvió %lld candidatos enviados; se conservó su orden de recuperación híbrida.
fr: Remarque : Le reranking n'a pas renvoyé %lld candidats soumis ; leur ordre de récupération hybride a été conservé.
id: Catatan: Rerank tidak mengembalikan %lld kandidat yang diajukan; urutan pengambilan hibrida mereka dipertahankan.
it: Nota: Rerank non ha restituito %lld candidati inviati; è stato mantenuto il loro ordine di recupero ibrido.
ja: 注: Rerankは%lld件の提出候補を返しませんでした。ハイブリッド検索順序が保持されました。
ko: 참고: Rerank가 제출된 %lld개 후보를 반환하지 않아 하이브리드 검색 순서가 유지되었습니다.
nl: Opmerking: Rerank heeft %lld ingediende kandidaten niet geretourneerd; hun hybride ophaalvolgorde is behouden.
pl: Uwaga: Rerank nie zwrócił %lld przesłanych kandydatów; zachowano ich kolejność z wyszukiwania hybrydowego.
pt_br: Nota: A reclassificação não retornou %lld candidatos enviados; sua ordem de recuperação híbrida foi mantida.
ru: Примечание: Rerank не вернул %lld отправленных кандидатов; их порядок гибридного поиска сохранён.
tr: Not: Rerank, gönderilen %lld adayı döndürmedi; hibrit alma sıraları korundu.
uk: Примітка: Rerank не повернув %lld поданих кандидатів; збережено їхній гібридний порядок пошуку.
vi: Lưu ý: Rerank không trả về %lld ứng viên đã gửi; thứ tự truy xuất kết hợp của chúng được giữ nguyên.
zh_hans: 备注：Rerank 未返回 %lld 个已发送候选，已按综合检索顺序保留。
zh_hant: 備註：Rerank 未返回 %lld 個已發送候選，已按綜合檢索順序保留。

# rag.workspace.debug.rerank.appliedResultFormat
source: #%1$lld: input [%2$lld], Rerank score %3$.4f
ar: #%1$lld: الإدخال [%2$lld]، درجة إعادة الترتيب %3$.4f
de: #%1$lld: Eingabe [%2$lld], Rerank-Score %3$.4f
es: #%1$lld: entrada [%2$lld], puntuación Rerank %3$.4f
fr: #%1$lld : entrée [%2$lld], score de reranking %3$.4f
id: #%1$lld: input [%2$lld], skor Rerank %3$.4f
it: #%1$lld: input [%2$lld], punteggio Rerank %3$.4f
ja: #%1$lld: 入力 [%2$lld], Rerankスコア %3$.4f
ko: #%1$lld: 입력 [%2$lld], Rerank 점수 %3$.4f
nl: #%1$lld: invoer [%2$lld], Rerank-score %3$.4f
pl: #%1$lld: wejście [%2$lld], wynik Rerank %3$.4f
pt_br: #%1$lld: entrada [%2$lld], pontuação de reclassificação %3$.4f
ru: #%1$lld: вход [%2$lld], оценка Rerank %3$.4f
tr: #%1$lld: girdi [%2$lld], Rerank puanı %3$.4f
uk: #%1$lld: вхід [%2$lld], оцінка Rerank %3$.4f
vi: #%1$lld: đầu vào [%2$lld], điểm Rerank %3$.4f
zh_hans: #%1$lld：输入 [%2$lld]，Rerank 分 %3$.4f
zh_hant: #%1$lld：輸入 [%2$lld]，Rerank 分 %3$.4f

# rag.workspace.debug.rerank.appliedUnsentNoteFormat
source: Note: Rerank candidates: %1$lld chunks; the remaining %2$lld chunks did not participate in Rerank and retained the hybrid retrieval order.
ar: ملاحظة: مرشحو إعادة الترتيب: %1$lld جزءًا؛ الأجزاء المتبقية %2$lld لم تشارك في إعادة الترتيب واحتفظت بترتيب الاسترجاع المختلط.
de: Hinweis: Rerank-Kandidaten: %1$lld Chunks; die restlichen %2$lld Chunks haben nicht am Rerank teilgenommen und behielten die hybride Abrufreihenfolge.
es: Nota: Candidatos Rerank: %1$lld fragmentos; los %2$lld fragmentos restantes no participaron en Rerank y conservaron el orden de recuperación híbrida.
fr: Remarque : Candidats au reranking : %1$lld fragments ; les %2$lld fragments restants n'ont pas participé au reranking et ont conservé l'ordre de récupération hybride.
id: Catatan: Kandidat Rerank: %1$lld potongan; %2$lld potongan sisanya tidak berpartisipasi dalam Rerank dan mempertahankan urutan pengambilan hibrida.
it: Nota: Candidati Rerank: %1$lld chunk; i restanti %2$lld chunk non hanno partecipato a Rerank e hanno mantenuto l'ordine di recupero ibrido.
ja: 注: Rerank候補: %1$lldチャンク。残りの%2$lldチャンクはRerankに参加せず、ハイブリッド検索順序が保持されました。
ko: 참고: Rerank 후보 %1$lld개 청크 중 나머지 %2$lld개 청크는 Rerank에 참여하지 않아 하이브리드 검색 순서가 유지되었습니다.
nl: Opmerking: Rerank-kandidaten: %1$lld chunks; de overige %2$lld chunks hebben niet deelgenomen aan Rerank en hebben de hybride ophaalvolgorde behouden.
pl: Uwaga: Kandydaci Rerank: %1$lld fragmentów; pozostałe %2$lld fragmentów nie uczestniczyło w Rerank i zachowało kolejność z wyszukiwania hybrydowego.
pt_br: Nota: Candidatos à reclassificação: %1$lld fragmentos; os %2$lld fragmentos restantes não participaram da reclassificação e mantiveram a ordem de recuperação híbrida.
ru: Примечание: Кандидатов Rerank: %1$lld фрагментов; оставшиеся %2$lld фрагментов не участвовали в Rerank и сохранили порядок гибридного поиска.
tr: Not: Rerank adayları: %1$lld parça; kalan %2$lld parça Rerank'a katılmadı ve hibrit alma sırasını korudu.
uk: Примітка: Кандидати Rerank: %1$lld фрагментів; решта %2$lld фрагментів не брали участі в Rerank і зберегли гібридний порядок пошуку.
vi: Lưu ý: Ứng viên Rerank: %1$lld khối; %2$lld khối còn lại không tham gia Rerank và giữ nguyên thứ tự truy xuất kết hợp.
zh_hans: 备注：Rerank 候选 %1$lld 个分片；后续 %2$lld 个分片不参与 Rerank，按综合检索顺序保留。
zh_hant: 備註：Rerank 候選 %1$lld 個分片；後續 %2$lld 個分片不參與 Rerank，按綜合檢索順序保留。

# rag.workspace.debug.rerank.candidateLimitFormat
source: Candidate limit: %lld
ar: حد المرشحين: %lld
de: Kandidatenlimit: %lld
es: Límite de candidatos: %lld
fr: Limite de candidats : %lld
id: Batas kandidat: %lld
it: Limite candidati: %lld
ja: 候補上限: %lld
ko: 후보 제한: %lld
nl: Kandidatenlimiet: %lld
pl: Limit kandydatów: %lld
pt_br: Limite de candidatos: %lld
ru: Лимит кандидатов: %lld
tr: Aday limiti: %lld
uk: Ліміт кандидатів: %lld
vi: Giới hạn ứng viên: %lld
zh_hans: 候选上限：%lld
zh_hant: 候選上限：%lld

# rag.workspace.debug.rerank.inputCandidateFormat
source: [%1$lld] Repository: %2$@ · Source: %3$@ · Section: %4$@ · Pre-rerank score: %.6f
ar: [%1$lld] المستودع: %2$@ · المصدر: %3$@ · القسم: %4$@ · الدرجة قبل إعادة الترتيب: %.6f
de: [%1$lld] Repository: %2$@ · Quelle: %3$@ · Abschnitt: %4$@ · Vor-Rerank-Score: %.6f
es: [%1$lld] Repositorio: %2$@ · Fuente: %3$@ · Sección: %4$@ · Puntuación previa a Rerank: %.6f
fr: [%1$lld] Dépôt : %2$@ · Source : %3$@ · Section : %4$@ · Score pré-reranking : %.6f
id: [%1$lld] Repositori: %2$@ · Sumber: %3$@ · Bagian: %4$@ · Skor pra-rerank: %.6f
it: [%1$lld] Repository: %2$@ · Fonte: %3$@ · Sezione: %4$@ · Punteggio pre-rerank: %.6f
ja: [%1$lld] リポジトリ: %2$@ · ソース: %3$@ · セクション: %4$@ · Rerank前スコア: %.6f
ko: [%1$lld] 저장소: %2$@ · 출처: %3$@ · 섹션: %4$@ · 사전 Rerank 점수: %.6f
nl: [%1$lld] Repository: %2$@ · Bron: %3$@ · Sectie: %4$@ · Pre-rerankscore: %.6f
pl: [%1$lld] Repozytorium: %2$@ · Źródło: %3$@ · Sekcja: %4$@ · Wynik przed rerank: %.6f
pt_br: [%1$lld] Repositório: %2$@ · Fonte: %3$@ · Seção: %4$@ · Pontuação pré-reclassificação: %.6f
ru: [%1$lld] Репозиторий: %2$@ · Источник: %3$@ · Раздел: %4$@ · Оценка до реранжирования: %.6f
tr: [%1$lld] Depo: %2$@ · Kaynak: %3$@ · Bölüm: %4$@ · Rerank öncesi puan: %.6f
uk: [%1$lld] Репозиторій: %2$@ · Джерело: %3$@ · Розділ: %4$@ · Оцінка до реранжування: %.6f
vi: [%1$lld] Kho lưu trữ: %2$@ · Nguồn: %3$@ · Phần: %4$@ · Điểm trước rerank: %.6f
zh_hans: [%1$lld] 仓库：%2$@ · 来源：%3$@ · 分区：%4$@ · 重排前综合检索分：%.6f
zh_hant: [%1$lld] 倉庫：%2$@ · 來源：%3$@ · 分區：%4$@ · 重排前綜合檢索分：%.6f

# rag.workspace.debug.rerank.inputCountFormat
source: Input candidates: %lld
ar: المرشحون المدخلون: %lld
de: Eingabekandidaten: %lld
es: Candidatos de entrada: %lld
fr: Candidats en entrée : %lld
id: Kandidat input: %lld
it: Candidati in input: %lld
ja: 入力候補: %lld
ko: 입력 후보: %lld
nl: Invoerkandidaten: %lld
pl: Kandydaci wejściowi: %lld
pt_br: Candidatos de entrada: %lld
ru: Входные кандидаты: %lld
tr: Girdi adayları: %lld
uk: Вхідні кандидати: %lld
vi: Ứng viên đầu vào: %lld
zh_hans: 输入候选：%lld 条
zh_hant: 輸入候選：%lld 條

# rag.workspace.debug.rerank.modelFormat
source: Model: %@
ar: النموذج: %@
de: Modell: %@
es: Modelo: %@
fr: Modèle : %@
it: Modello: %@
ja: モデル: %@
ko: 모델: %@
pt_br: Modelo: %@
ru: Модель: %@
uk: Модель: %@
vi: Mô hình: %@
zh_hans: 模型：%@
zh_hant: 模型：%@

# rag.workspace.debug.rerank.providerFormat
source: Service type: %@
ar: نوع الخدمة: %@
de: Diensttyp: %@
es: Tipo de servicio: %@
fr: Type de service : %@
id: Jenis layanan: %@
it: Tipo di servizio: %@
ja: サービス種別: %@
ko: 서비스 유형: %@
pl: Typ usługi: %@
pt_br: Tipo de serviço: %@
ru: Тип сервиса: %@
tr: Hizmet türü: %@
uk: Тип служби: %@
vi: Loại dịch vụ: %@
zh_hans: 服务类型：%@
zh_hant: 服務類型：%@

# rag.workspace.debug.rerank.queryFormat
source: Query: %@
ar: الاستعلام: %@
de: Abfrage: %@
es: Consulta: %@
fr: Requête : %@
id: Kueri: %@
ja: クエリ: %@
ko: 쿼리: %@
pl: Zapytanie: %@
pt_br: Consulta: %@
ru: Запрос: %@
tr: Sorgu: %@
uk: Запит: %@
vi: Truy vấn: %@
zh_hans: 查询：%@
zh_hant: 查詢：%@

# rag.workspace.debug.rerank.request.title
source: Rerank Request
ar: طلب إعادة الترتيب
de: Rerank-Anfrage
es: Solicitud de Rerank
fr: Requête de reranking
id: Permintaan Rerank
it: Richiesta Rerank
ja: Rerankリクエスト
ko: Rerank 요청
nl: Rerank-verzoek
pl: Żądanie Rerank
pt_br: Solicitação de Reclassificação
ru: Запрос на реранжирование
tr: Rerank İsteği
uk: Запит на реранжування
vi: Yêu cầu Rerank
zh_hans: Rerank 请求
zh_hant: Rerank 請求

# rag.workspace.debug.retrieval.conclusion.allBelowThreshold
source: No local chunks: every semantic candidate from enabled sources is below the current similarity threshold.
ar: لا توجد أجزاء محلية: كل مرشح دلالي من المصادر الممكّنة أقل من حد التشابه الحالي.
de: Keine lokalen Chunks: Jeder semantische Kandidat aus aktivierten Quellen liegt unter dem aktuellen Ähnlichkeitsschwellenwert.
es: Sin fragmentos locales: cada candidato semántico de las fuentes habilitadas está por debajo del umbral de similitud actual.
fr: Aucun fragment local : chaque candidat sémantique des sources activées est en dessous du seuil de similarité actuel.
id: Tidak ada potongan lokal: setiap kandidat semantik dari sumber yang diaktifkan berada di bawah ambang kemiripan saat ini.
it: Nessun chunk locale: ogni candidato semantico dalle fonti abilitate è al di sotto della soglia di similarità corrente.
ja: ローカルチャンクなし: 有効なソースからのすべてのセマンティック候補が現在の類似度しきい値を下回っています。
ko: 로컬 청크 없음: 활성화된 출처의 모든 의미 후보가 현재 유사도 임계값 미만입니다.
nl: Geen lokale chunks: elke semantische kandidaat van ingeschakelde bronnen ligt onder de huidige overeenkomstdrempel.
pl: Brak lokalnych fragmentów: każdy kandydat semantyczny z włączonych źródeł jest poniżej bieżącego progu podobieństwa.
pt_br: Nenhum fragmento local: todos os candidatos semânticos de fontes habilitadas estão abaixo do limite de similaridade atual.
ru: Нет локальных фрагментов: все семантические кандидаты из включённых источников ниже текущего порога схожести.
tr: Yerel parça yok: etkin kaynaklardaki her anlamsal aday, mevcut benzerlik eşiğinin altında.
uk: Немає локальних фрагментів: кожен семантичний кандидат з увімкнених джерел нижчий за поточний поріг подібності.
vi: Không có khối cục bộ: mọi ứng viên ngữ nghĩa từ các nguồn đã bật đều dưới ngưỡng tương đồng hiện tại.
zh_hans: 没有可用的本地分片：所有启用来源的语义候选都低于当前相似度阈值。
zh_hant: 沒有可用的本地分片：所有啟用來源的語義候選都低於目前相似度閾值。

# rag.workspace.debug.retrieval.conclusion.completedFormat
source: Ready to answer with %1$lld chunks from %2$lld repositories.
ar: جاهز للإجابة باستخدام %1$lld جزءًا من %2$lld مستودعًا.
de: Bereit zur Beantwortung mit %1$lld Chunks aus %2$lld Repositories.
es: Listo para responder con %1$lld fragmentos de %2$lld repositorios.
fr: Prêt à répondre avec %1$lld fragments provenant de %2$lld dépôts.
id: Siap menjawab dengan %1$lld potongan dari %2$lld repositori.
it: Pronto per rispondere con %1$lld chunk da %2$lld repository.
ja: %1$lld個のチャンク（%2$lldリポジトリ）で回答準備完了
ko: %1$lld개 저장소에서 %2$lld개 청크로 답변할 준비가 되었습니다.
nl: Klaar om te antwoorden met %1$lld chunks uit %2$lld repositories.
pl: Gotowy do odpowiedzi z %1$lld fragmentami z %2$lld repozytoriów.
pt_br: Pronto para responder com %1$lld fragmentos de %2$lld repositórios.
ru: Готов ответить с %1$lld фрагментами из %2$lld репозиториев.
tr: %1$lld depodan %2$lld parça ile yanıtlamaya hazır.
uk: Готовий відповісти з %1$lld фрагментів з %2$lld репозиторіїв.
vi: Sẵn sàng trả lời với %1$lld khối từ %2$lld kho lưu trữ.
zh_hans: 已保留 %1$lld 条分片，来自 %2$lld 个仓库，可用于回答。
zh_hant: 已保留 %1$lld 條分片，來自 %2$lld 個倉庫，可用於回答。

# rag.workspace.debug.retrieval.conclusion.noCandidates
source: No local chunks: no repositories matched the current scope.
ar: لا توجد أجزاء محلية: لم تطابق أي مستودعات النطاق الحالي.
de: Keine lokalen Chunks: Keine Repositories stimmen mit dem aktuellen Bereich überein.
es: Sin fragmentos locales: ningún repositorio coincide con el ámbito actual.
fr: Aucun fragment local : aucun dépôt ne correspond à la portée actuelle.
id: Tidak ada potongan lokal: tidak ada repositori yang cocok dengan lingkup saat ini.
it: Nessun chunk locale: nessun repository corrisponde all'ambito corrente.
ja: ローカルチャンクなし: 現在のスコープに一致するリポジトリがありません。
ko: 로컬 청크 없음: 현재 범위와 일치하는 저장소가 없습니다.
nl: Geen lokale chunks: geen repositories komen overeen met de huidige scope.
pl: Brak lokalnych fragmentów: żadne repozytorium nie pasuje do bieżącego zakresu.
pt_br: Nenhum fragmento local: nenhum repositório correspondeu ao escopo atual.
ru: Нет локальных фрагментов: ни один репозиторий не соответствует текущей области.
tr: Yerel parça yok: hiçbir depo mevcut kapsamla eşleşmedi.
uk: Немає локальних фрагментів: жоден репозиторій не відповідає поточній області.
vi: Không có khối cục bộ: không có kho lưu trữ nào khớp với phạm vi hiện tại.
zh_hans: 没有可用的本地分片：当前范围内没有候选仓库。
zh_hant: 沒有可用的本地分片：目前範圍內沒有候選倉庫。

# rag.workspace.debug.retrieval.conclusion.noEvidence
source: No local chunks remained after source, similarity, or ranking filters.
ar: لم تتبق أجزاء محلية بعد تطبيق مرشحات المصدر أو التشابه أو الترتيب.
de: Keine lokalen Chunks nach Quell-, Ähnlichkeits- oder Ranking-Filtern.
es: No quedaron fragmentos locales después de los filtros de fuente, similitud o clasificación.
fr: Aucun fragment local après les filtres de source, de similarité ou de classement.
id: Tidak ada potongan lokal yang tersisa setelah filter sumber, kemiripan, atau peringkat.
it: Nessun chunk locale rimasto dopo i filtri di fonte, similarità o ranking.
ja: ローカルチャンクなし: ソース、類似度、またはランキングフィルター後に残りませんでした。
ko: 로컬 청크 없음: 출처, 유사도 또는 순위 필터 후 남은 청크가 없습니다.
nl: Geen lokale chunks overgebleven na bron-, overeenkomst- of rangschikkingsfilters.
pl: Brak lokalnych fragmentów po zastosowaniu filtrów źródła, podobieństwa lub rankingu.
pt_br: Nenhum fragmento local restante após filtros de fonte, similaridade ou classificação.
ru: Не осталось локальных фрагментов после фильтрации по источнику, схожести или ранжированию.
tr: Kaynak, benzerlik veya sıralama filtrelerinden sonra yerel parça kalmadı.
uk: Немає локальних фрагментів: після фільтрів джерела, подібності або ранжування не залишилося фрагментів.
vi: Không có khối cục bộ nào còn lại sau các bộ lọc nguồn, tương đồng hoặc xếp hạng.
zh_hans: 没有可用的本地分片：候选在来源、相似度或排序过滤后未留下可用分片。
zh_hant: 沒有可用的本地分片：候選在來源、相似度或排序過濾後未留下可用分片。

# rag.workspace.debug.retrieval.conclusion.noRawHits
source: No local chunks: keyword and semantic search returned no candidate chunks.
ar: لا توجد أجزاء محلية: لم يُرجع البحث بالكلمات المفتاحية والدلالي أي أجزاء مرشحة.
de: Keine lokalen Chunks: Stichwort- und semantische Suche ergaben keine Kandidaten-Chunks.
es: Sin fragmentos locales: la búsqueda por palabras clave y semántica no devolvió fragmentos candidatos.
fr: Aucun fragment local : la recherche par mot-clé et sémantique n'a renvoyé aucun fragment candidat.
id: Tidak ada potongan lokal: pencarian kata kunci dan semantik tidak mengembalikan potongan kandidat.
it: Nessun chunk locale: la ricerca per parole chiave e semantica non ha restituito chunk candidati.
ja: ローカルチャンクなし: キーワードおよびセマンティック検索で候補チャンクが見つかりませんでした。
ko: 로컬 청크 없음: 키워드 및 의미 검색이 후보 청크를 반환하지 않았습니다.
nl: Geen lokale chunks: zoekopdracht op trefwoord en semantiek leverde geen kandidaat-chunks op.
pl: Brak lokalnych fragmentów: wyszukiwanie słów kluczowych i semantyczne nie zwróciło żadnych kandydatów.
pt_br: Nenhum fragmento local: a busca por palavra-chave e semântica não retornou fragmentos candidatos.
ru: Нет локальных фрагментов: поиск по ключевым словам и семантический поиск не вернули ни одного фрагмента-кандидата.
tr: Yerel parça yok: anahtar kelime ve anlamsal arama hiçbir aday parça döndürmedi.
uk: Немає локальних фрагментів: пошук за ключовими словами та семантичний пошук не повернули жодного фрагмента-кандидата.
vi: Không có khối cục bộ: tìm kiếm từ khóa và ngữ nghĩa không trả về khối ứng viên nào.
zh_hans: 没有可用的本地分片：关键词和语义检索都没有返回候选分片。
zh_hant: 沒有可用的本地分片：關鍵詞和語義檢索都沒有返回候選分片。

# rag.workspace.debug.retrieval.conclusion.noReadyChunks
source: No local chunks: the candidate repositories have no ready chunks for the current embedding model.
ar: لا توجد أجزاء محلية: المستودعات المرشحة لا تحتوي على أجزاء جاهزة لنموذج التضمين الحالي.
de: Keine lokalen Chunks: Die Kandidaten-Repositories haben keine bereiten Chunks für das aktuelle Einbettungsmodell.
es: Sin fragmentos locales: los repositorios candidatos no tienen fragmentos listos para el modelo de incrustación actual.
fr: Aucun fragment local : les dépôts candidats n'ont pas de fragments prêts pour le modèle d'incorporation actuel.
id: Tidak ada potongan lokal: repositori kandidat tidak memiliki potongan siap untuk model embedding saat ini.
it: Nessun chunk locale: i repository candidati non hanno chunk pronti per il modello di embedding corrente.
ja: ローカルチャンクなし: 候補リポジトリに現在の埋め込みモデル用の準備済みチャンクがありません。
ko: 로컬 청크 없음: 후보 저장소에 현재 임베딩 모델에 대한 준비된 청크가 없습니다.
nl: Geen lokale chunks: de kandidaat-repositories hebben geen gereed chunks voor het huidige inbeddingsmodel.
pl: Brak lokalnych fragmentów: repozytoria kandydujące nie mają gotowych fragmentów dla bieżącego modelu osadzania.
pt_br: Nenhum fragmento local: os repositórios candidatos não possuem fragmentos prontos para o modelo de incorporação atual.
ru: Нет локальных фрагментов: репозитории-кандидаты не имеют готовых фрагментов для текущей модели эмбеддингов.
tr: Yerel parça yok: aday depoların mevcut gömme modeli için hazır parçası yok.
uk: Немає локальних фрагментів: репозиторії-кандидати не мають готових фрагментів для поточної моделі вбудовування.
vi: Không có khối cục bộ: các kho lưu trữ ứng viên không có khối sẵn sàng cho mô hình nhúng hiện tại.
zh_hans: 没有可用的本地分片：候选仓库没有当前 embedding 模型的已就绪分片。
zh_hant: 沒有可用的本地分片：候選倉庫沒有目前 embedding 模型的已就緒分片。

# rag.workspace.debug.retrieval.conclusion.skippedStructured
source: Chunk retrieval was skipped because this question only uses structured repository data.
ar: تم تخطي استرجاع الأجزاء لأن هذا السؤال يستخدم فقط بيانات المستودع المنظمة.
de: Chunk-Abruf wurde übersprungen, da diese Frage nur strukturierte Repository-Daten verwendet.
es: La recuperación de fragmentos se omitió porque esta pregunta solo utiliza datos estructurados del repositorio.
fr: La récupération de fragments a été ignorée car cette question utilise uniquement des données de dépôt structurées.
id: Pengambilan potongan dilewati karena pertanyaan ini hanya menggunakan data repositori terstruktur.
it: Il recupero dei chunk è stato saltato perché questa domanda utilizza solo dati strutturati del repository.
ja: この質問は構造化リポジトリデータのみを使用するため、チャンク検索はスキップされました。
ko: 이 질문은 구조화된 저장소 데이터만 사용하므로 청크 검색이 건너뛰어졌습니다.
nl: Chunk-ophaling overgeslagen omdat deze vraag alleen gestructureerde repositorygegevens gebruikt.
pl: Pominięto wyszukiwanie fragmentów, ponieważ to pytanie używa tylko danych strukturalnych repozytorium.
pt_br: A recuperação de fragmentos foi ignorada porque esta pergunta usa apenas dados estruturados do repositório.
ru: Поиск фрагментов пропущен, так как этот вопрос использует только структурированные данные репозитория.
tr: Parça alma atlandı çünkü bu soru yalnızca yapılandırılmış depo verilerini kullanıyor.
uk: Пошук фрагментів пропущено, оскільки це запитання використовує лише структуровані дані репозиторію.
vi: Bỏ qua truy xuất khối vì câu hỏi này chỉ sử dụng dữ liệu kho lưu trữ có cấu trúc.
zh_hans: 未执行分片检索：当前问题只读取结构化仓库数据。
zh_hant: 未執行分片檢索：目前問題只讀取結構化倉庫資料。

# rag.workspace.debug.retrieval.conclusion.sourcesDisabled
source: No local chunks: all chunk sources are currently disabled.
ar: لا توجد أجزاء محلية: جميع مصادر الأجزاء معطلة حاليًا.
de: Keine lokalen Chunks: Alle Chunk-Quellen sind derzeit deaktiviert.
es: Sin fragmentos locales: todas las fuentes de fragmentos están actualmente deshabilitadas.
fr: Aucun fragment local : toutes les sources de fragments sont actuellement désactivées.
id: Tidak ada potongan lokal: semua sumber potongan saat ini dinonaktifkan.
it: Nessun chunk locale: tutte le fonti di chunk sono attualmente disabilitate.
ja: ローカルチャンクなし: すべてのチャンクソースが現在無効になっています。
ko: 로컬 청크 없음: 모든 청크 출처가 현재 비활성화되어 있습니다.
nl: Geen lokale chunks: alle chunkbronnen zijn momenteel uitgeschakeld.
pl: Brak lokalnych fragmentów: wszystkie źródła fragmentów są obecnie wyłączone.
pt_br: Nenhum fragmento local: todas as fontes de fragmentos estão desabilitadas no momento.
ru: Нет локальных фрагментов: все источники фрагментов в настоящее время отключены.
tr: Yerel parça yok: tüm parça kaynakları şu anda devre dışı.
uk: Немає локальних фрагментів: усі джерела фрагментів наразі вимкнено.
vi: Không có khối cục bộ: tất cả các nguồn khối hiện đang bị tắt.
zh_hans: 没有可用的本地分片：当前没有启用任何分片来源。
zh_hant: 沒有可用的本地分片：目前沒有啟用任何分片來源。

# rag.workspace.debug.retrieval.conclusion.title
source: Result
ar: النتيجة
de: Ergebnis
es: Resultado
fr: Résultat
id: Hasil
it: Risultato
ja: 結果
ko: 결과
nl: Resultaat
pl: Wynik
pt_br: Resultado
ru: Результат
tr: Sonuç
uk: Результат
vi: Kết quả
zh_hans: 检索结果
zh_hant: 結果

# rag.workspace.debug.retrieval.evidenceDetails.title
source: Final Chunks
ar: الأجزاء النهائية
de: Finale Chunks
es: Fragmentos finales
fr: Fragments finaux
id: Potongan Akhir
it: Chunk finali
ja: 最終チャンク
ko: 최종 청크
nl: Definitieve chunks
pl: Ostateczne fragmenty
pt_br: Fragmentos Finais
ru: Финальные фрагменты
tr: Son Parçalar
uk: Остаточні фрагменти
vi: Khối cuối cùng
zh_hans: 最终分片
zh_hant: 最終分片

# rag.workspace.debug.retrieval.funnel.candidatesFormat
source: Searched %lld candidate repositories.
ar: تم البحث في %lld مستودعًا مرشحًا.
de: %lld Kandidaten-Repositories durchsucht.
es: Se buscaron %lld repositorios candidatos.
fr: %lld dépôts candidats recherchés.
id: Mencari %lld repositori kandidat.
it: Cercati %lld repository candidati.
ja: 検索対象の候補リポジトリ: %lld
ko: %lld개 후보 저장소를 검색했습니다.
nl: %lld kandidaat-repositories doorzocht.
pl: Przeszukano %lld repozytoriów kandydujących.
pt_br: Pesquisados %lld repositórios candidatos.
ru: Поиск выполнен в %lld репозиториях-кандидатах.
tr: %lld aday depo tarandı.
uk: Знайдено %lld репозиторіїв-кандидатів.
vi: Đã tìm kiếm %lld kho lưu trữ ứng viên.
zh_hans: 已在 %lld 个候选仓库中搜索。
zh_hant: 已在 %lld 個候選倉庫中搜尋。

# rag.workspace.debug.retrieval.funnel.errorsFormat
source: Search issue: %@
ar: مشكلة في البحث: %@
de: Suchproblem: %@
es: Problema de búsqueda: %@
fr: Problème de recherche : %@
id: Masalah pencarian: %@
it: Problema di ricerca: %@
ja: 検索の問題: %@
ko: 검색 문제: %@
nl: Zoekprobleem: %@
pl: Problem z wyszukiwaniem: %@
pt_br: Problema de busca: %@
ru: Проблема поиска: %@
tr: Arama sorunu: %@
uk: Проблема пошуку: %@
vi: Sự cố tìm kiếm: %@
zh_hans: 检索异常：%@
zh_hant: 搜尋異常：%@
